app/Services/AuthService.php

SELECT *
FROM `users`
WHERE `email` = 'sgrgowthamraj63@gmail.com'
 LIMIT 1
---
    public function validateLogin(string $email, string $password)
    {
        $user = $this->userModel->where('email', $email)->first();

SELECT *
FROM `roles`
WHERE `roles`.`id` = '1'
---
    public function loginUser(array $user)
    {
        $session = session();

        // Fetch permissions for the user's role
        // For now, we assume we can get it via a join or updated query in UserModel
        // But to keep it simple, we'll fetch role details
        $roleModel = new \App\Models\RoleModel();
        $role = $roleModel->find($user['role_id']);