app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `customers`
SELECT COUNT(*) AS `numrows`
FROM `products`
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `employees`
WHERE `status` = 'active'
AND `employees`.`deleted_at` IS NULL
SELECT SUM(`total_stock`) AS `total_stock`
FROM `products`
SELECT SUM(`total_amount`) AS `total_amount`
FROM `invoices`
WHERE `status` != 'Void'
AND `status` != 'Draft'
AND YEAR(invoice_date) = '2026'
SELECT SUM(`total_amount`) AS `total_amount`
FROM `bills`
WHERE `status` != 'Void'
AND `status` != 'Draft'
AND YEAR(bill_date) = '2026'
---
    public function index()
    {
        $customerModel = new \App\Models\CustomerModel();
        $productModel = new \App\Models\ProductModel();
        $invoiceModel = new \App\Models\InvoiceModel();
        $billModel = new \App\Models\BillModel();
        $userModel = new \App\Models\UserModel();
        $employeeModel = new \App\Models\EmployeeModel();
        $returnModel = new \App\Models\ProductItemModel();
        $db = \Config\Database::connect();

        // 1. Basic Counts & Summary
        $data['totalCustomers'] = $customerModel->countAllResults();
        $data['totalProducts'] = $productModel->countAllResults();
        $data['userCount'] = $userModel->countAllResults();
        $data['employeeCount'] = $employeeModel->where('status', 'active')->countAllResults();

        // 2. Stock Management
        $data['itemsInStock'] = $productModel->selectSum('total_stock')->get()->getRow()->total_stock ?? 0;

        // 3. Financial Totals (Current Year)
        $currentYear = date('Y');
        $data['totalSales'] = $invoiceModel->selectSum('total_amount')
            ->where('status !=', 'Void')
            ->where('status !=', 'Draft')
            ->where('YEAR(invoice_date)', $currentYear)
            ->get()->getRow()->total_amount ?? 0;

        $data['totalPurchases'] = $billModel->selectSum('total_amount')
            ->where('status !=', 'Void')
            ->where('status !=', 'Draft')
            ->where('YEAR(bill_date)', $currentYear)
            ->get()->getRow()->total_amount ?? 0;

SELECT SUM(`agent_commission_amount`) AS `agent_commission_amount`
FROM `invoices`
WHERE `agent_commission_status` = 'Unpaid'
---
        $data['profitMargin'] = ($data['totalSales'] > 0) ? ($data['totalProfit'] / $data['totalSales']) * 100 : 0;

        // 5. Agent Commissions
        $data['pendingCommissions'] = $invoiceModel->selectSum('agent_commission_amount')
            ->where('agent_commission_status', 'Unpaid')
            ->get()->getRow()->agent_commission_amount ?? 0;

SELECT SUM(`total_amount`) AS `total_amount`
FROM `invoices`
WHERE DATE_FORMAT(invoice_date, '%Y-%m') = '2025-11'
AND `status` NOT IN ('Void','Draft')
SELECT SUM(`total_amount`) AS `total_amount`
FROM `bills`
WHERE DATE_FORMAT(bill_date, '%Y-%m') = '2025-11'
AND `status` NOT IN ('Void','Draft')
---
            $months[] = date('M Y', strtotime("-$i months"));

            // Sales per month
            $sTotal = $invoiceModel->selectSum('total_amount')
                ->where("DATE_FORMAT(invoice_date, '%Y-%m')", $monthDay)
                ->whereNotIn('status', ['Void', 'Draft'])
                ->get()->getRow()->total_amount ?? 0;
            $salesTrend[] = (float) $sTotal;

            // Purchases per month
            $pTotal = $billModel->selectSum('total_amount')
                ->where("DATE_FORMAT(bill_date, '%Y-%m')", $monthDay)
                ->whereNotIn('status', ['Void', 'Draft'])
                ->get()->getRow()->total_amount ?? 0;

SELECT `product_categories`.`category_name` as `label`, SUM(invoice_items.amount) as value
FROM `invoice_items`
JOIN `products` ON `products`.`id` = `invoice_items`.`product_id`
JOIN `product_categories` ON `product_categories`.`id` = `products`.`category_id`
GROUP BY `products`.`category_id`
ORDER BY `value` DESC
 LIMIT 5
SELECT `products`.`product_name`, SUM(invoice_items.quantity) as total_qty, SUM(invoice_items.amount) as total_revenue
FROM `invoice_items`
JOIN `products` ON `products`.`id` = `invoice_items`.`product_id`
GROUP BY `invoice_items`.`product_id`
ORDER BY `total_revenue` DESC
 LIMIT 5
SELECT `customers`.`name`, COUNT(invoices.id) as total_orders, SUM(invoices.total_amount) as total_spent
FROM `invoices`
JOIN `customers` ON `customers`.`id` = `invoices`.`customer_id`
WHERE `invoices`.`status` NOT IN ('Void','Draft')
GROUP BY `invoices`.`customer_id`
ORDER BY `total_spent` DESC
 LIMIT 5
---
        $data['returnTrend'] = $returnTrend;

        // 7. Category Performance (Pie Chart)
        $data['categorySales'] = $db->table('invoice_items')
            ->select('product_categories.category_name as label, SUM(invoice_items.amount) as value')
            ->join('products', 'products.id = invoice_items.product_id')
            ->join('product_categories', 'product_categories.id = products.category_id')
            ->groupBy('products.category_id')
            ->orderBy('value', 'DESC')
            ->limit(5)
            ->get()->getResultArray();

        // 8. Top Performance Metrics
        // Top 5 Selling Products
        $data['topProducts'] = $db->table('invoice_items')
            ->select('products.product_name, SUM(invoice_items.quantity) as total_qty, SUM(invoice_items.amount) as total_revenue')
            ->join('products', 'products.id = invoice_items.product_id')
            ->groupBy('invoice_items.product_id')
            ->orderBy('total_revenue', 'DESC')
            ->limit(5)
            ->get()->getResultArray();

        // Top 5 Customers
        $data['topCustomers'] = $db->table('invoices')
            ->select('customers.name, COUNT(invoices.id) as total_orders, SUM(invoices.total_amount) as total_spent')
            ->join('customers', 'customers.id = invoices.customer_id')
            ->whereNotIn('invoices.status', ['Void', 'Draft'])
            ->groupBy('invoices.customer_id')
            ->orderBy('total_spent', 'DESC')
            ->limit(5)
            ->get()->getResultArray();