app/Models/BillModel.php

    public function getBillsWithVendor($filters = [])
    {
        $builder = $this->select('bills.*, vendors.name as vendor_name')
            ->join('vendors', 'vendors.id = bills.vendor_id', 'left');

        if (!empty($filters['vendor_id'])) {
            $builder->where('bills.vendor_id', $filters['vendor_id']);
        }

        if (!empty($filters['status'])) {
            $builder->where('bills.status', $filters['status']);
        }

        if (!empty($filters['date_from'])) {
            $builder->where('bills.bill_date >=', $filters['date_from']);
        }

        if (!empty($filters['date_to'])) {
            $builder->where('bills.bill_date <=', $filters['date_to']);
        }

        return $builder->orderBy('bills.created_at', 'DESC')->findAll();
---
SELECT `bills`.*, `vendors`.`name` as `vendor_name`
FROM `bills`
LEFT JOIN `vendors` ON `vendors`.`id` = `bills`.`vendor_id`
ORDER BY `bills`.`created_at` DESC