app/Models/CalendarReminderModel.php

    public function getDueReminders()
    {
        return $this->where('reminder_date <=', date('Y-m-d'))
                    ->where('status', 'pending')
                    ->where('is_notified', 0)
                    ->findAll();
---
SELECT *
FROM `calendar_reminders`
WHERE `reminder_date` <= '2026-04-28'
AND `status` = 'pending'
AND `is_notified` = 0