app/Models/InvoiceModel.php

SELECT `invoices`.*, `customers`.`name` as `customer_name`, `addresses`.`city` as `customer_city`
FROM `invoices`
LEFT JOIN `customers` ON `customers`.`id` = `invoices`.`customer_id`
LEFT JOIN `addresses` ON `addresses`.`owner_id` = `customers`.`id` AND `addresses`.`owner_type` = "customer" AND `addresses`.`address_type` = "billing" AND `addresses`.`is_active` = 1
ORDER BY `invoices`.`created_at` DESC
---
    public function getInvoicesWithCustomer($filters = [])
    {
        $builder = $this->select('invoices.*, customers.name as customer_name, addresses.city as customer_city')
            ->join('customers', 'customers.id = invoices.customer_id', 'left')
            ->join('addresses', 'addresses.owner_id = customers.id AND addresses.owner_type = "customer" AND addresses.address_type = "billing" AND addresses.is_active = 1', 'left');

        if (!empty($filters['customer_id'])) {
            $builder->where('invoices.customer_id', $filters['customer_id']);
        }

        if (!empty($filters['status'])) {
            $builder->where('invoices.status', $filters['status']);
        }

        if (!empty($filters['date_from'])) {
            $builder->where('invoices.invoice_date >=', $filters['date_from']);
        }

        if (!empty($filters['date_to'])) {
            $builder->where('invoices.invoice_date <=', $filters['date_to']);
        }

        return $builder->orderBy('invoices.created_at', 'DESC')->findAll();