app/Models/NotificationModel.php

    public function getUnread()
    {
        return $this->where('is_read', 0)->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `notifications`
WHERE `is_read` = 0
ORDER BY `created_at` DESC