app/Models/RolePermissionModel.php

    public function getPermissionsByRole(int $roleId)
    {
        return $this->select('permissions.permission_key')
            ->join('permissions', 'permissions.id = role_permissions.permission_id')
            ->where('role_id', $roleId)
            ->findAll();
---
SELECT `permissions`.`permission_key`
FROM `role_permissions`
JOIN `permissions` ON `permissions`.`id` = `role_permissions`.`permission_id`
WHERE `role_id` = 1