app/Libraries/Notifier.php

    public static function refresh()
    {
        $notificationModel = new NotificationModel();
        $productModel = new ProductModel();
        $invoiceModel = new InvoiceModel();

        // 1. Check for Invoices waiting for Transport LR
        $waitingInvoices = $invoiceModel->where('transport_name !=', '')
            ->where("(waybill_number = '' OR waybill_number IS NULL)")
            ->findAll();

        foreach ($waitingInvoices as $invoice) {
            $msg = "Invoice #{$invoice['invoice_number']} is waiting for Transport LR (Waybill) update.";

            $exists = $notificationModel->where('type', 'lr_update')
                ->where('reference_id', $invoice['id'])
                ->where('is_read', 0)
                ->first();
---
SELECT *
FROM `invoices`
WHERE `transport_name` != ''
AND (`waybill_number` = '' OR `waybill_number` IS NULL)
SELECT *
FROM `notifications`
WHERE `type` = 'lr_update'
AND `reference_id` = '9'
AND `is_read` = 0
 LIMIT 1

        }

        // 3. Auto-Resolve: Mark notifications as read if the issue is fixed
        $unread = $notificationModel->where('is_read', 0)->findAll();
---
SELECT *
FROM `notifications`
WHERE `is_read` = 0

            $resolved = false;

            if ($notify['type'] == 'lr_update') {
                $inv = $invoiceModel->find($notify['reference_id']);
---
SELECT *
FROM `invoices`
WHERE `invoices`.`id` = '9'